# Removendo valores duplicados

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('./Sample-Data/outrosFormatos/aluguel.csv', sep=';')

In [5]:
df.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento
5,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,50.00,Apartamento
6,Apartamento,Freguesia (Jacarepaguá),3,0,0,54,950.0,300.0,28.0,17.59,Apartamento
7,Apartamento,Barra da Tijuca,2,1,1,67,1700.0,589.0,147.0,25.37,Apartamento
8,Apartamento,Tijuca,2,1,0,110,1900.0,700.0,138.0,17.27,Apartamento
9,Apartamento,Olaria,3,1,0,68,1000.0,670.0,0.0,14.71,Apartamento

In [6]:
df['Tipo']

0        Apartamento
1        Apartamento
2        Apartamento
3        Apartamento
4        Apartamento
5        Apartamento
6        Apartamento
7        Apartamento
8        Apartamento
9        Apartamento
10       Apartamento
11       Apartamento
12       Apartamento
13       Apartamento
14       Apartamento
15       Apartamento
16       Apartamento
17       Apartamento
18       Apartamento
19       Apartamento
20       Apartamento
21       Apartamento
22       Apartamento
23       Apartamento
24       Apartamento
25       Apartamento
26       Apartamento
27       Apartamento
28       Apartamento
29       Apartamento
            ...
19801      Quitinete
19802      Quitinete
19803      Quitinete
19804      Quitinete
19805      Quitinete
19806      Quitinete
19807      Quitinete
19808      Quitinete
19809      Quitinete
19810      Quitinete
19811      Quitinete
19812      Quitinete
19813      Quitinete
19814      Quitinete
19815      Quitinete
19816      Quitinete
19817      Quitinete
19818      Quitinete
19819      Quitinete
19820      Quitinete
19821      Quitinete
19822      Quitinete
19823      Quitinete
19824      Quitinete
19825      Quitinete
19826      Quitinete
19827      Quitinete
19828      Quitinete
19829      Quitinete
19830      Quitinete
Name: Tipo, Length: 19831, dtype: object

In [7]:
tipo_de_imovel = df['Tipo']

In [8]:
# DataFrame é um conjunto de Series, agora eu selecionei um desses Series
type(tipo_de_imovel)

pandas.core.series.Series

In [9]:
tipo_de_imovel.drop_duplicates(inplace = True)

In [10]:
tipo_de_imovel

0               Apartamento
16923                  Casa
17821    Casa de Condomínio
18785          Casa de Vila
19018             Quitinete
Name: Tipo, dtype: object

## Visualização

In [13]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)
tipo_de_imovel

                     Tipo
0             Apartamento
16923                Casa
17821  Casa de Condomínio
18785        Casa de Vila
19018           Quitinete

In [14]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0])
tipo_de_imovel

                 Tipo
0         Apartamento
1                Casa
2  Casa de Condomínio
3        Casa de Vila
4           Quitinete

In [17]:
tipo_de_imovel.columns.name = 'id'
tipo_de_imovel

id                Tipo
0          Apartamento
1                 Casa
2   Casa de Condomínio
3         Casa de Vila
4            Quitinete